#### Terraform Format and Style 🖌`success`
#### dev Terraform Initialization ⚙️`success`
#### dev Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### dev Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mdata.terraform_remote_state.shared_services: Refreshing state...[0m
[0m[1mmodule.aks_agw_ingress.data.helm_repository.ingress_azure: Refreshing state...[0m
[0m[1mmodule.aks_agw_ingress.data.azurerm_client_config.current: Refreshing state...[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.aks_agw_ingress.helm_release.ingress_azure[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "helm_release" "ingress_azure" {
      [32m+[0m [0m[1m[0matomic[0m[0m                     = false
      [32m+[0m [0m[1m[0mchart[0m[0m                      = "ingress-azure"
      [32m+[0m [0m[1m[0mcleanup_on_fail[0m[0m            = false
      [32m+[0m [0m[1m[0mdependency_update[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_crd_hooks[0m[0m          = false
      [32m+[0m [0m[1m[0mdisable_openapi_validation[0m[0m = false
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m           = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m               = false
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mmax_history[0m[0m                = 0
      [32m+[0m [0m[1m[0mmetadata[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                       = "application-gateway-kubernetes"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                  = "default"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m              = false
      [32m+[0m [0m[1m[0mrender_subchart_notes[0m[0m      = true
      [32m+[0m [0m[1m[0mreplace[0m[0m                    = false
      [32m+[0m [0m[1m[0mrepository[0m[0m                 = "application-gateway-kubernetes-ingress"
      [32m+[0m [0m[1m[0mreset_values[0m[0m               = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m               = false
      [32m+[0m [0m[1m[0mskip_crds[0m[0m                  = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                     = "deployed"
      [32m+[0m [0m[1m[0mtimeout[0m[0m                    = 300
      [32m+[0m [0m[1m[0mvalues[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mverify[0m[0m                     = false
      [32m+[0m [0m[1m[0mversion[0m[0m                    = "1.0.0"
      [32m+[0m [0m[1m[0mwait[0m[0m                       = true
    }

[1m  # module.aks_agw_ingress.null_resource.aks_config[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "aks_config" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.null_resource.aks_test_app[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "null_resource" "aks_test_app" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.module.aks.azurerm_kubernetes_cluster.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "base" {
      [32m+[0m [0m[1m[0mdns_prefix[0m[0m              = "nodes"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkube_admin_config[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mkube_admin_config_raw[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mkube_config[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mkube_config_raw[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mkubelet_identity[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_version[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "aks-dev-eastus"
      [32m+[0m [0m[1m[0mnode_resource_group[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mprivate_cluster_enabled[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_fqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_link_enabled[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-aks-dev-eastus"
      [32m+[0m [0m[1m[0msku_tier[0m[0m                = "Free"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0maddon_profile {
          [32m+[0m [0maci_connector_linux {
              [32m+[0m [0m[1m[0menabled[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0msubnet_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mazure_policy {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhttp_application_routing {
              [32m+[0m [0m[1m[0menabled[0m[0m                            = (known after apply)
              [32m+[0m [0m[1m[0mhttp_application_routing_zone_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mkube_dashboard {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0moms_agent {
              [32m+[0m [0m[1m[0menabled[0m[0m                    = (known after apply)
              [32m+[0m [0m[1m[0mlog_analytics_workspace_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moms_agent_identity[0m[0m         = (known after apply)
            }
        }

      [32m+[0m [0mauto_scaler_profile {
          [32m+[0m [0m[1m[0mbalance_similar_node_groups[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmax_graceful_termination_sec[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_add[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_delete[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_failure[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_unneeded[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_unready[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_utilization_threshold[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mscan_interval[0m[0m                    = (known after apply)
        }

      [32m+[0m [0mdefault_node_pool {
          [32m+[0m [0m[1m[0mmax_pods[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                 = "default"
          [32m+[0m [0m[1m[0mnode_count[0m[0m           = 1
          [32m+[0m [0m[1m[0morchestrator_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mos_disk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                 = {
              [32m+[0m [0m"terraform_managed" = "true"
            }
          [32m+[0m [0m[1m[0mtype[0m[0m                 = "VirtualMachineScaleSets"
          [32m+[0m [0m[1m[0mvm_size[0m[0m              = "Standard_B2s"
          [32m+[0m [0m[1m[0mvnet_subnet_id[0m[0m       = (known after apply)
        }

      [32m+[0m [0mnetwork_profile {
          [32m+[0m [0m[1m[0mdns_service_ip[0m[0m     = "10.1.3.10"
          [32m+[0m [0m[1m[0mdocker_bridge_cidr[0m[0m = "172.17.0.1/16"
          [32m+[0m [0m[1m[0mload_balancer_sku[0m[0m  = "Basic"
          [32m+[0m [0m[1m[0mnetwork_plugin[0m[0m     = "azure"
          [32m+[0m [0m[1m[0mnetwork_policy[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0moutbound_type[0m[0m      = "loadBalancer"
          [32m+[0m [0m[1m[0mpod_cidr[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mservice_cidr[0m[0m       = "10.1.3.0/24"

          [32m+[0m [0mload_balancer_profile {
              [32m+[0m [0m[1m[0meffective_outbound_ips[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmanaged_outbound_ip_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ip_address_ids[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ip_prefix_ids[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ports_allocated[0m[0m  = (known after apply)
            }
        }

      [32m+[0m [0mrole_based_access_control {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

          [32m+[0m [0mazure_active_directory {
              [32m+[0m [0m[1m[0madmin_group_object_ids[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mclient_app_id[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mmanaged[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mserver_app_id[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mserver_app_secret[0m[0m      = (sensitive value)
              [32m+[0m [0m[1m[0mtenant_id[0m[0m              = (known after apply)
            }
        }

      [32m+[0m [0mservice_principal {
          [32m+[0m [0m[1m[0mclient_id[0m[0m     = "d265b1f3-8015-4031-b076-d83c975f87ed"
          [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
        }

      [32m+[0m [0mwindows_profile {
          [32m+[0m [0m[1m[0madmin_password[0m[0m = (sensitive value)
          [32m+[0m [0m[1m[0madmin_username[0m[0m = (known after apply)
        }
    }

[1m  # module.aks_agw_ingress.module.application_gateway.azurerm_application_gateway.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_application_gateway" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "agw-aks-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-aks-dev-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0mbackend_address_pool {
          [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m = "agw-aks-beap"
        }

      [32m+[0m [0mbackend_http_settings {
          [32m+[0m [0m[1m[0mcookie_based_affinity[0m[0m               = "Disabled"
          [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                                = "agw-aks-be-htst"
          [32m+[0m [0m[1m[0mpick_host_name_from_backend_address[0m[0m = false
          [32m+[0m [0m[1m[0mport[0m[0m                                = 80
          [32m+[0m [0m[1m[0mprobe_id[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0mprotocol[0m[0m                            = "Http"
          [32m+[0m [0m[1m[0mrequest_timeout[0m[0m                     = 1
        }

      [32m+[0m [0mfrontend_ip_configuration {
          [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                          = "agw-aks-feip"
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }

      [32m+[0m [0mfrontend_port {
          [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m = "agw-aks-feport"
          [32m+[0m [0m[1m[0mport[0m[0m = 80
        }
      [32m+[0m [0mfrontend_port {
          [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m = "agw-aks-feport-443"
          [32m+[0m [0m[1m[0mport[0m[0m = 443
        }

      [32m+[0m [0mgateway_ip_configuration {
          [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m      = "appGatewayIpConfig"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m = (known after apply)
        }

      [32m+[0m [0mhttp_listener {
          [32m+[0m [0m[1m[0mfrontend_ip_configuration_id[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mfrontend_ip_configuration_name[0m[0m = "agw-aks-feip"
          [32m+[0m [0m[1m[0mfrontend_port_id[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mfrontend_port_name[0m[0m             = "agw-aks-feport"
          [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                           = "agw-aks-httplstn"
          [32m+[0m [0m[1m[0mprotocol[0m[0m                       = "Http"
          [32m+[0m [0m[1m[0mssl_certificate_id[0m[0m             = (known after apply)
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mrequest_routing_rule {
          [32m+[0m [0m[1m[0mbackend_address_pool_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mbackend_address_pool_name[0m[0m  = "agw-aks-beap"
          [32m+[0m [0m[1m[0mbackend_http_settings_id[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mbackend_http_settings_name[0m[0m = "agw-aks-be-htst"
          [32m+[0m [0m[1m[0mhttp_listener_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mhttp_listener_name[0m[0m         = "agw-aks-httplstn"
          [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                       = "agw-aks-rqrt"
          [32m+[0m [0m[1m[0mredirect_configuration_id[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mrewrite_rule_set_id[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mrule_type[0m[0m                  = "Basic"
          [32m+[0m [0m[1m[0murl_path_map_id[0m[0m            = (known after apply)
        }

      [32m+[0m [0msku {
          [32m+[0m [0m[1m[0mcapacity[0m[0m = 1
          [32m+[0m [0m[1m[0mname[0m[0m     = "Standard_v2"
          [32m+[0m [0m[1m[0mtier[0m[0m     = "Standard_v2"
        }

      [32m+[0m [0mssl_policy {
          [32m+[0m [0m[1m[0mcipher_suites[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mdisabled_protocols[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmin_protocol_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpolicy_name[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpolicy_type[0m[0m          = (known after apply)
        }
    }

[1m  # module.aks_agw_ingress.module.public_ip.azurerm_public_ip.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_public_ip" "base" {
      [32m+[0m [0m[1m[0mallocation_method[0m[0m       = "Static"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m = 4
      [32m+[0m [0m[1m[0mip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mip_version[0m[0m              = "IPv4"
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "pip-agw-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "rg-aks-dev-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0mtags[0m[0m                    = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.aks_agw_ingress.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-aks-dev-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.aks_agw_ingress.module.role_assignment_aks_0.azurerm_role_assignment.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = "e7e9c92f-4927-48e5-9042-263c2e65ba36"
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "Network Contributor"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.module.role_assignment_aks_1.azurerm_role_assignment.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = "e7e9c92f-4927-48e5-9042-263c2e65ba36"
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "Managed Identity Operator"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.module.role_assignment_aks_2.azurerm_role_assignment.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "Contributor"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.module.role_assignment_aks_3.azurerm_role_assignment.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mprincipal_type[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrole_definition_name[0m[0m             = "Reader"
      [32m+[0m [0m[1m[0mscope[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mskip_service_principal_aad_check[0m[0m = (known after apply)
    }

[1m  # module.aks_agw_ingress.module.subnet.azurerm_subnet.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.1.2.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-agw-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-spoke-dev-eastus"
    }

[1m  # module.aks_agw_ingress.module.subnet.azurerm_subnet.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.1.1.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-aks-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-spoke-dev-eastus"
    }

[1m  # module.aks_agw_ingress.module.user_assigned_identity.azurerm_user_assigned_identity.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "base" {
      [32m+[0m [0m[1m[0mclient_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "mi-aks-dev-eastus"
      [32m+[0m [0m[1m[0mprincipal_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-aks-dev-eastus"
    }

[1m  # module.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "base" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                      = "Hot"
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                     = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m         = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m        = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                   = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                         = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m               = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m              = "rg-diagnostic-storage-dev-eastus"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m               = (known after apply)

      [32m+[0m [0mblob_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }
    }

[1m  # module.boot_diag_storage.module.diagnostic_storage_account.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 4
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.boot_diag_storage.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-diagnostic-storage-dev-eastus"
    }

[1m  # module.k8s_cluster.module.lb_backend_address_pool_k8s_master.azurerm_lb_backend_address_pool.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_lb_backend_address_pool" "base" {
      [32m+[0m [0m[1m[0mbackend_ip_configurations[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_rules[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mloadbalancer_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "beap-k8s_master"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m       = "rg--dev-eastus"
    }

[1m  # module.k8s_cluster.module.lb_backend_address_pool_k8s_node.azurerm_lb_backend_address_pool.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_lb_backend_address_pool" "base" {
      [32m+[0m [0m[1m[0mbackend_ip_configurations[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_rules[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mloadbalancer_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "beap-k8s-node"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m       = "rg--dev-eastus"
    }

[1m  # module.k8s_cluster.module.lb_k8s_master.azurerm_lb.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_lb" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m             = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "lbi-k8s_master-dev-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m  = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                  = "Standard"

      [32m+[0m [0mfrontend_ip_configuration {
          [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0minbound_nat_rules[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mload_balancer_rules[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                          = "feip-config-lbi-k8s_master"
          [32m+[0m [0m[1m[0moutbound_rules[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_prefix_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.lb_k8s_node.azurerm_lb.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_lb" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m             = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "lbi-k8s-node-dev-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m  = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msku[0m[0m                  = "Standard"

      [32m+[0m [0mfrontend_ip_configuration {
          [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
          [32m+[0m [0m[1m[0minbound_nat_rules[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mload_balancer_rules[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                          = "feip-config-lbi-k8s-node"
          [32m+[0m [0m[1m[0moutbound_rules[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0mpublic_ip_address_id[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpublic_ip_prefix_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [32m+[0m [0m[1m[0mbackend_address_pool_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s_master-00-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m    = (known after apply)
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_master.azurerm_network_interface_backend_address_pool_association.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [32m+[0m [0m[1m[0mbackend_address_pool_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s_master-01-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m    = (known after apply)
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [32m+[0m [0m[1m[0mbackend_address_pool_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s-node-00-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m    = (known after apply)
    }

[1m  # module.k8s_cluster.module.network_interface_backend_address_pool_association_k8s_node.azurerm_network_interface_backend_address_pool_association.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface_backend_address_pool_association" "base" {
      [32m+[0m [0m[1m[0mbackend_address_pool_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mip_configuration_name[0m[0m   = "ip-nic-lvm-k8s-node-01-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m    = (known after apply)
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-lvm-k8s_master-00-dev-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-lvm-k8s_master-00-dev-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_master.azurerm_network_interface.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-lvm-k8s_master-01-dev-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-lvm-k8s_master-01-dev-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-lvm-k8s-node-00-dev-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-lvm-k8s-node-00-dev-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.network_interface_k8s_node.azurerm_network_interface.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_network_interface" "base" {
      [32m+[0m [0m[1m[0mapplied_dns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdns_servers[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0menable_accelerated_networking[0m[0m = false
      [32m+[0m [0m[1m[0menable_ip_forwarding[0m[0m          = false
      [32m+[0m [0m[1m[0mid[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0minternal_dns_name_label[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0minternal_domain_name_suffix[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                      = "eastus"
      [32m+[0m [0m[1m[0mmac_address[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                          = "nic-lvm-k8s-node-01-dev-eastus"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m           = "rg--dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m            = (known after apply)

      [32m+[0m [0mip_configuration {
          [32m+[0m [0m[1m[0mname[0m[0m                          = "ip-nic-lvm-k8s-node-01-dev-eastus"
          [32m+[0m [0m[1m[0mprimary[0m[0m                       = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ip_address_allocation[0m[0m = "dynamic"
          [32m+[0m [0m[1m[0mprivate_ip_address_version[0m[0m    = "IPv4"
          [32m+[0m [0m[1m[0msubnet_id[0m[0m                     = (known after apply)
        }
    }

[1m  # module.k8s_cluster.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg--dev-eastus"
    }

[1m  # module.k8s_cluster.module.subnet.azurerm_subnet.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.1.3.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-k8s-master-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-spoke-dev-eastus"
    }

[1m  # module.k8s_cluster.module.subnet.azurerm_subnet.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_subnet" "base" {
      [32m+[0m [0m[1m[0maddress_prefix[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0maddress_prefixes[0m[0m                               = [
          [32m+[0m [0m"10.1.4.0/24",
        ]
      [32m+[0m [0m[1m[0menforce_private_link_endpoint_network_policies[0m[0m = false
      [32m+[0m [0m[1m[0menforce_private_link_service_network_policies[0m[0m  = false
      [32m+[0m [0m[1m[0mid[0m[0m                                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                           = "snet-k8s-node-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                            = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m                           = "vnet-spoke-dev-eastus"
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_master.azurerm_linux_virtual_machine.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m      = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m                   = "k8s-mast-00-deea"
      [32m+[0m [0m[1m[0mdisable_password_authentication[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m                   = -1
      [32m+[0m [0m[1m[0mname[0m[0m                            = "lvm-k8s-master-00-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m                        = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                            = "Standard_B2s"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                            = "1"

      [32m+[0m [0madmin_ssh_key {
          [32m+[0m [0m[1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
          [32m+[0m [0m[1m[0musername[0m[0m   = "kuhlmanlabs"
        }

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = (known after apply)
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-lvm-k8s-master-00-dev-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "UbuntuServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "Canonical"
          [32m+[0m [0m[1m[0msku[0m[0m       = "18.04"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m      = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m                   = "k8s-node-00-deea"
      [32m+[0m [0m[1m[0mdisable_password_authentication[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m                   = -1
      [32m+[0m [0m[1m[0mname[0m[0m                            = "lvm-k8s-node-00-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m                        = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                            = "Standard_B2s"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                            = "1"

      [32m+[0m [0madmin_ssh_key {
          [32m+[0m [0m[1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
          [32m+[0m [0m[1m[0musername[0m[0m   = "kuhlmanlabs"
        }

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = (known after apply)
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-lvm-k8s-node-00-dev-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "UbuntuServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "Canonical"
          [32m+[0m [0m[1m[0msku[0m[0m       = "18.04"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.k8s_cluster.module.virtual_machine_k8s_node.azurerm_linux_virtual_machine.base[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine" "base" {
      [32m+[0m [0m[1m[0madmin_username[0m[0m                  = "kuhlmanlabs"
      [32m+[0m [0m[1m[0mallow_extension_operations[0m[0m      = true
      [32m+[0m [0m[1m[0mcomputer_name[0m[0m                   = "k8s-node-01-deea"
      [32m+[0m [0m[1m[0mdisable_password_authentication[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                        = "eastus"
      [32m+[0m [0m[1m[0mmax_bid_price[0m[0m                   = -1
      [32m+[0m [0m[1m[0mname[0m[0m                            = "lvm-k8s-node-01-dev-eastus"
      [32m+[0m [0m[1m[0mnetwork_interface_ids[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpriority[0m[0m                        = "Regular"
      [32m+[0m [0m[1m[0mprivate_ip_address[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_addresses[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprovision_vm_agent[0m[0m              = true
      [32m+[0m [0m[1m[0mpublic_ip_address[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip_addresses[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m             = "rg--dev-eastus"
      [32m+[0m [0m[1m[0msize[0m[0m                            = "Standard_B2s"
      [32m+[0m [0m[1m[0mvirtual_machine_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mzone[0m[0m                            = "2"

      [32m+[0m [0madmin_ssh_key {
          [32m+[0m [0m[1m[0mpublic_key[0m[0m = <<~EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCefzVIJz2gW279dPUR+PbpTXQjx3TA6dhWxXeVW70QSpTlqIVKLg7K6nKlFkMP70Zda9XuXJpUS2eDH94QQ6bK5Udq7TOQU5MAzWSgITGSBhVwfJuihdjkFvedAeq5804zHzmAGt0rIvp5mg1frCmwb1ipXRlSEWcrEjT8lPO5kpABemHkLU0u7E6U2UO66sTcpkej/jKUghblZVl02IaSiOMIIm6XrnD782OiWbh8oe8CWbDSWmNXWtYK2F5gm9WoFMk4ZqRqGocW82WUICTeRw4umqTFBG5dQDRoxVm4mhhoGajArHG6y6LM6hGt6yOmMtxMhFA0wgLPyC6mjIqp
            EOT
          [32m+[0m [0m[1m[0musername[0m[0m   = "kuhlmanlabs"
        }

      [32m+[0m [0mboot_diagnostics {
          [32m+[0m [0m[1m[0mstorage_account_uri[0m[0m = (known after apply)
        }

      [32m+[0m [0mos_disk {
          [32m+[0m [0m[1m[0mcaching[0m[0m                   = "None"
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                      = "osdisk-lvm-k8s-node-01-dev-eastus"
          [32m+[0m [0m[1m[0mstorage_account_type[0m[0m      = "Standard_LRS"
          [32m+[0m [0m[1m[0mwrite_accelerator_enabled[0m[0m = false
        }

      [32m+[0m [0msource_image_reference {
          [32m+[0m [0m[1m[0moffer[0m[0m     = "UbuntuServer"
          [32m+[0m [0m[1m[0mpublisher[0m[0m = "Canonical"
          [32m+[0m [0m[1m[0msku[0m[0m       = "18.04"
          [32m+[0m [0m[1m[0mversion[0m[0m   = "latest"
        }
    }

[1m  # module.linux_web_app.module.app_service.azurerm_app_service.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service" "base" {
      [32m+[0m [0m[1m[0mapp_service_plan_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mapp_settings[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mclient_affinity_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdefault_site_hostname[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                        = true
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                     = false
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                       = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m            = "rg-linux-web-app-dev-eastus"
      [32m+[0m [0m[1m[0msite_credential[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_control[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_params[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m     = (sensitive value)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m   = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m = (sensitive value)
            }
        }

      [32m+[0m [0mconnection_string {
          [32m+[0m [0m[1m[0mname[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mvalue[0m[0m = (sensitive value)
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mlogs {
          [32m+[0m [0mapplication_logs {
              [32m+[0m [0mazure_blob_storage {
                  [32m+[0m [0m[1m[0mlevel[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msas_url[0m[0m           = (sensitive value)
                }
            }

          [32m+[0m [0mhttp_logs {
              [32m+[0m [0mazure_blob_storage {
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msas_url[0m[0m           = (sensitive value)
                }

              [32m+[0m [0mfile_system {
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mretention_in_mb[0m[0m   = (known after apply)
                }
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mapp_command_line[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mauto_swap_slot_name[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mdefault_documents[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mdotnet_framework_version[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mftps_state[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mhealth_check_path[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mip_restriction[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mjava_container[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mjava_container_version[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mjava_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mlinux_fx_version[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_mysql_enabled[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mmin_tls_version[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mphp_version[0m[0m                 = (known after apply)
          [32m+[0m [0m[1m[0mpython_version[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mscm_ip_restriction[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mscm_type[0m[0m                    = (known after apply)
          [32m+[0m [0m[1m[0mscm_use_main_ip_restriction[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0muse_32_bit_worker_process[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mwindows_fx_version[0m[0m          = (known after apply)

          [32m+[0m [0mcors {
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0msupport_credentials[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mstorage_account {
          [32m+[0m [0m[1m[0maccess_key[0m[0m   = (sensitive value)
          [32m+[0m [0m[1m[0maccount_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmount_path[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mshare_name[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }
    }

[1m  # module.linux_web_app.module.app_service.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 4
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.linux_web_app.module.app_service_plan.azurerm_app_service_plan.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service_plan" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                         = "Linux"
      [32m+[0m [0m[1m[0mlocation[0m[0m                     = "eastus"
      [32m+[0m [0m[1m[0mmaximum_elastic_worker_count[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmaximum_number_of_workers[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "asp-linux-dev-eastus"
      [32m+[0m [0m[1m[0mreserved[0m[0m                     = true
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "rg-linux-web-app-dev-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m                         = {
          [32m+[0m [0m"terraform_managed" = "true"
        }

      [32m+[0m [0msku {
          [32m+[0m [0m[1m[0mcapacity[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msize[0m[0m     = "F1"
          [32m+[0m [0m[1m[0mtier[0m[0m     = "Free"
        }
    }

[1m  # module.linux_web_app.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-linux-web-app-dev-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_spoke.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_spoke.module.virtual_network.azurerm_virtual_network.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "base" {
      [32m+[0m [0m[1m[0maddress_space[0m[0m       = [
          [32m+[0m [0m"10.1.0.0/16",
        ]
      [32m+[0m [0m[1m[0mguid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                = "vnet-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0msubnet[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"terraform_managed" = "true"
        }
    }

[1m  # module.network_spoke.module.virtual_network_peering_hub.azurerm_virtual_network_peering.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network_peering" "base" {
      [32m+[0m [0m[1m[0mallow_forwarded_traffic[0m[0m      = true
      [32m+[0m [0m[1m[0mallow_gateway_transit[0m[0m        = true
      [32m+[0m [0m[1m[0mallow_virtual_network_access[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "vnet-transit-hub-shared-services-eastus-to-vnet-spoke-dev-eastus"
      [32m+[0m [0m[1m[0mremote_virtual_network_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "rg-network-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0muse_remote_gateways[0m[0m          = false
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m         = "vnet-transit-hub-shared-services-eastus"
    }

[1m  # module.network_spoke.module.virtual_network_peering_spoke.azurerm_virtual_network_peering.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network_peering" "base" {
      [32m+[0m [0m[1m[0mallow_forwarded_traffic[0m[0m      = true
      [32m+[0m [0m[1m[0mallow_gateway_transit[0m[0m        = false
      [32m+[0m [0m[1m[0mallow_virtual_network_access[0m[0m = true
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "vnet-spoke-dev-eastus-to-vnet-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mremote_virtual_network_id[0m[0m    = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "rg-network-spoke-dev-eastus"
      [32m+[0m [0m[1m[0muse_remote_gateways[0m[0m          = true
      [32m+[0m [0m[1m[0mvirtual_network_name[0m[0m         = "vnet-spoke-dev-eastus"
    }

[0m[1mPlan:[0m 43 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./devtfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./devtfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*